
Процедура ОбработкаПроведения(Отказ, Режим)
	
	
	// регистр АктивныеПосещения Расход
	Движения.АктивныеПосещения.Записывать = Истина;
	Движения.Записать(); 
	
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	АктивныеПосещенияОстатки.ВидАттракциона КАК ВидАттракциона,
	|	АктивныеПосещенияОстатки.КоличествоПосещенийОстаток КАК КоличествоПосещенийОстаток
	|ИЗ
	|	РегистрНакопления.АктивныеПосещения.Остатки(, Основание = &Основание) КАК АктивныеПосещенияОстатки"; 

	Запрос.УстановитьПараметр("Основание", Основание);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	 ОсталосьПосещений = 0;
	 ВидАттракционаАбонемента = Неопределено;
	 
	 Если Выборка.Следующий() Тогда
		
		ОсталосьПосещений 		 = Выборка.КоличествоПосещенийОстаток;
		ВидАттракционаАбонемента = Выборка.ВидАттракциона;
		
	КонецЕсли;
	 
	 Если ОсталосьПосещений<1 Тогда
		 Отказ = Истина;
		 Сообщение = Новый СообщениеПользователю;
		 Сообщение.Текст = "В билете не осталось посещений."; 
		 Сообщение.УстановитьДанные(ЭтотОбъект);
		 Сообщение.Поле = "Основание";  
		 Сообщение.Сообщить();
	 КонецЕсли; 
	 
	 ВидАттракционаДокумента = ВидАттракциона(Аттракцион);
	 
	 Если ЗначениеЗаполнено(ВидАттракционаАбонемента)
		 И ВидАттракционаДокумента<>ВидАттракционаАбонемента Тогда
		 
		 Отказ = Истина;
		 Сообщение = Новый СообщениеПользователю;
		 Сообщение.Текст = "Билет не подходит для посещения этого аттракциона."; 
		 Сообщение.УстановитьДанные(ЭтотОбъект);
		 Сообщение.Поле = "Основание";  
		 Сообщение.Сообщить(); 
		 
	 КонецЕсли;   
	 
	 Если Отказ Тогда
		 Возврат;
	 КонецЕсли;
	 
	 
	 
	
	Движение = Движения.АктивныеПосещения.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Основание = Основание;
	Движение.ВидАттракциона = ВидАттракционаАбонемента;
	Движение.КоличествоПосещений = 1; 
	
	Движения.Записать();
	
		
	

КонецПроцедуры


Функция  ВидАттракциона(Аттракцион)  
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Аттракционы.ВидАттракциона КАК ВидАттракциона
	               |ИЗ
	               |	Справочник.Аттракционы КАК Аттракционы
	               |ГДЕ
	               |	Аттракционы.Ссылка = &Ссылка";  
	
	Запрос.УстановитьПараметр("Ссылка", Аттракцион); 
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Выборка.Следующий(); 
	
		
	Возврат Выборка.ВидАттракциона;	
	
КонецФункции

